In [4]:
import pandas as pd

In [16]:
df = pd.DataFrame({
...                     
...                    'Student': {0: "Michael", 1: "Arushi", 2: "Roberta", 
...                     3: "Michael", 4: "Arushi", 5: "Roberta"},
...                    'Score': {0: 90, 1: 98, 2: 92, 3: 90, 4: 98, 5: 92}, 
...                    'Date': {0: "2018-01-03", 1: "2018-01-03", 2: "2018-01-03", 3: "2018-01-13", 
...                     4: "2018-01-13", 5: "2018-01-13"}}, 
...                     columns=['Date','Student','Score'])

In [17]:
df

         Date  Student  Score
0  2018-01-03  Michael     90
1  2018-01-03   Arushi     98
2  2018-01-03  Roberta     92
3  2018-01-13  Michael     90
4  2018-01-13   Arushi     98
5  2018-01-13  Roberta     92

In [10]:
pd.pivot(df, index = "Date", columns = "Student", values= "Score")

Student     Ganesh  Hari  Yeshwanth
Date
2018-01-03      90    92         98
2018-01-13      90    92         98

In [19]:
df = pd.DataFrame({'Student': {0: "Michael", 1: "Arushi", 2: "Roberta"},
...                    'SAT': {0: 1480, 1: 1520, 2: 1460}, 
...                    'ACT': {0: 34, 1: 32, 2: 32}}, 
...                     columns=['Student','SAT','ACT'])

In [12]:
df

   Student   SAT  ACT
0  Michael  1480   34
1   Arushi  1520   32
2  Roberta  1460   32

In [13]:
pd.melt(df, id_vars = "Student", var_name = "Test", value_vars = ["SAT", "ACT"], value_name = "Scores")

   Student Test  Scores
0  Michael  SAT    1480
1   Arushi  SAT    1520
2  Roberta  SAT    1460
3  Michael  ACT      34
4   Arushi  ACT      32
5  Roberta  ACT      32